from typing import List
from histr import Shabdansh
import pytest


@pytest.mark.parametrize(
    "text, splits",
    [
        ("बिक्रम मेरो नाम हो", ["बि", "क्र", "म", " ", "मे", "रो", " ", "ना", "म", " ", "हो"]),
        ("रानीकंुँवर", ["रा", "नी", "कंुँ", "व", "र"]),
        ("अंंंंंंंंंंंंंंंंंंंंगद", ["अंंंंंंंंंंंंंंंंंंंं", "ग", "द"]),
        ("अंंिकत", ["अंंि", "क", "त"]),
        ("अंबंुज", ["अं", "बंु", "ज"]),
        ("अंिहवरनसिं", ["अंि", "ह", "व", "र", "न", "सिं"]),
        ("अंोंकारचन्द", ["अंों", "का", "र", "च", "न्द"]),
        ("लीलावतेीे", ["ली", "ला", "व", "तेीे"]),
        ("लुख्ुड", ["लु", "ख्ु", "ड"]),
        ("लीलांिसह", ["ली", "लांि", "स", "ह"]),
        ("राजदत्त्", ["रा", "ज", "द", "त्त्"]),
    ],
)
def test_cluster_splitting(text: str, splits: List[str]):
    text = Shabdansh(text)
    assert text.str_ls == splits
